# data frame create using list

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [2]:
name = ['safeer','dhavood','anzal','arun','ramshad','jishnu','annan','siraj']
age = [24,24,25,25,24,24,25,23]

In [3]:
data = pd.DataFrame(list(zip(name,age)))

In [4]:
data

         0   1
0   safeer  24
1  dhavood  24
2    anzal  25
3     arun  25
4  ramshad  24
5   jishnu  24
6    annan  25
7    siraj  23

In [5]:
data = pd.DataFrame(list(zip(name,age)), columns=['Name','Age'])

In [6]:
data

      Name  Age
0   safeer   24
1  dhavood   24
2    anzal   25
3     arun   25
4  ramshad   24
5   jishnu   24
6    annan   25
7    siraj   23

In [9]:
n = int(input("enter a n value:"))
d = {}

for i in range(n):
    Name = input("enter the name") 
    Age = int(input("enter the age")) 
    d[Name] = Age
print(d)

enter a n value:7
enter the namesafeer
enter the age24
enter the namedhavood
enter the age24
enter the nameanzal
enter the age25
enter the namearun
enter the age25
enter the nameramshad
enter the age25
enter the namejishnu
enter the age24
enter the nameannan
enter the age25
{'safeer': 24, 'dhavood': 24, 'anzal': 25, 'arun': 25, 'ramshad': 25, 'jishnu': 24, 'annan': 25}

In [14]:
q = [
    {'Name':'varun','Age':'24'},
    {'Name':'arun','Age':'24'},
    {'Name':'leela','Age':'24'},
    {'Name':'geetha','Age':'24'},
    {'Name':'salim','Age':'24'},
    {'Name':'john','Age':'24'},
]

In [15]:
a=pd.DataFrame(q)

In [16]:
a

     Name Age
0   varun  24
1    arun  24
2   leela  24
3  geetha  24
4   salim  24
5    john  24

In [18]:
b=[
    {'Name':'rita','Age':'24','dob':'12/12/1998','gender':'f'},
    {'Name':'arun','Age':'24','dob':'12/12/1998','gender':'m'},
    {'Name':'sitha','Age':'24','dob':'12/12/1998','gender':'f'},
    {'Name':'varun','Age':'24','dob':'12/12/1998','gender':'m'},
    {'Name':'ram','Age':'24','dob':'12/12/1998','gender':'m'},
    {'Name':'radha','Age':'24','dob':'12/12/1998','gender':'f'},
    {'Name':'mohan','Age':'24','dob':'12/12/1998','gender':'m'},
    {'Name':'devi','Age':'24','dob':'12/12/1998','gender':'f'},
    {'Name':'nidhi','Age':'24','dob':'12/12/1998','gender':'f'}
]

In [19]:
c=pd.DataFrame(b)

In [20]:
c

    Name Age         dob gender
0   rita  24  12/12/1998      f
1   arun  24  12/12/1998      m
2  sitha  24  12/12/1998      f
3  varun  24  12/12/1998      m
4    ram  24  12/12/1998      m
5  radha  24  12/12/1998      f
6  mohan  24  12/12/1998      m
7   devi  24  12/12/1998      f
8  nidhi  24  12/12/1998      f